(function(){
	window.Map = function(){
		//数组就是表格
		this.mapCode = [
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,2,0,0,0,0,0,0],
		[0,0,0,0,0,2,0,0,0,0,0,0],
		[0,0,0,0,0,2,0,0,0,0,0,0],
		[0,0,0,0,0,2,0,0,0,0,0,0],
		[0,0,0,0,0,2,0,0,0,0,0,0],
		[0,0,0,0,0,2,0,0,0,0,0,0],
		[0,0,0,0,0,3,0,0,0,0,0,0],
		[0,0,0,0,0,3,0,0,0,0,0,0],
		[1,2,2,2,4,3,0,0,5,2,2,6],
		// 墙
		[9,9,9,9,9,9,9,9,9,9,9,9]
		];
	}
	Map.prototype.render = function(){
		// 渲染地图
		for(var i = 0; i < 20; i++){
			for(var j = 0; j < 12; j++){
				if(this.mapCode[i][j] != 0){
					game.setColor(i,j,this.mapCode[i][j])
				}
			}
		}
	}
	Map.prototype.remove = function(){
		for(var i = 0; i < 20; i++){
			// 判断，一共20行，某一行都不是0了，就说明都有颜色，该消行了
			if(this.mapCode[i].indexOf(0) == -1){
				// 删除这一行
				this.mapCode.splice(i,1);
				// 删一行补一行
				this.mapCode.unshift([0,0,0,0,0,0,0,0,0,0,0,0])
				//加分数
				game.score += 10;
				$("h1").html("分数："+game.score )
			}
		}
	}
	Map.prototype.gameOver = function(){
		// 判断死亡，如果地图的顶部初始渲染方块的4*4的矩阵中有颜色，就说明游戏结束了
		for(var i = 0; i < 4; i++){
			for(var j = 0; j < 4; j++){
				if(this.mapCode[i][j + 4] != 0){
					// 停止定时器
					clearInterval(game.timer)
					alert("游戏结束，您的游戏分数为"+game.score+"分！！");
					return;
				}
			}
		}
	}
})()